app/controllers/dashboard_controller.rb

SELECT "product_matches".* FROM "product_matches"
---
  def index
    @matches = ProductMatch.all